me/clojure.org
#+TITLE:     Clojure
#+AUTHOR:    Fogus
#+DATE:      <2020-02-05 Wed>
#+LANGUAGE:            en
#+OPTIONS:             H:3 num:nil toc:1 \n:nil
#+OPTIONS:             TeX:t LaTeX:t skip:nil d:nil todo:t pri:nil tags:not-in-toc
#+INFOJS_OPT:          view:nil toc:nil ltoc:t mouse:underline buttons:0 path:http://orgmode.org/org-info.js
#+EXPORT_SELECT_TAGS:  export
#+EXPORT_EXCLUDE_TAGS: noexport

/This is a collection of Clojure / ClojureScript information and links to resources. Please [[http://www.twitter.com/fogus][tweet]] any suggestions, questions, changes, or corrections to me./

 # This page is inspired by the old http://www.lispmachine.net site.

* What is Clojure

[[http://www.clojure.org][Clojure]] is an open-source functional programming language that runs on the [[https://en.wikipedia.org/wiki/Java_virtual_machine][Java Virtual Machine]] in the [[http://en.wikipedia.org/wiki/Lisp_programming_language][Lisp]] family of programming languages. [[https://www.clojurescript.org][ClojureScript]] is a version of Clojure that
compiles to JavaScript source code. Core features of both Clojure and ClojureScript include a rich set of immutable, persistent data structures, a code-as-data 
philosophical bent, and a powerful macro system. 

* The Language

Clojure as a language has a relatively simple core, thus allowing the language to target different runtimes including, but not limited to, the following:

- [[http://www.clojure.org][Clojure]] - Runs on the Java Virtual Machine and interoperates with Java libraries.
- [[https://www.clojurescript.org][ClojureScript]] - Targets JavaScript runtimes by compiling to JavaScript source code.
- [[https://github.com/clojure/clojure-clr][Clojure CLR]] - Runs on the Common Language Runtime (CLR), the execution engine of [[https://en.wikipedia.org/wiki/.NET_Framework][Microsoft's .Net Framework]].

* Notable Clojure Books

Clojure has grown since its initial release in 2007 and has motivated quite a collection of books. Below you'll find a list of those that I have personally read --
in one case wrote -- and would recommend as a fairly strong Clojure curriculum. 

- [[https://www.amazon.com/Living-Clojure-Introduction-Training-Developers/dp/1491909048?tag=fogus-20][Living Clojure]] by Carin Meier - A great introduction to Clojure and its ecosystem, written in a fun and breezy style.
- [[https://www.amazon.com/Programming-Clojure-Pragmatic-Programmers-Miller/dp/1680502468/?tag=fogus-20][Programming Clojure]] by Alex Miller, Stuart Halloway, and Aaron Bedra - The first Clojure book to hit the market by two of the core maintainers of the language itself.
- [[http://www.joyofclojure.com][The Joy of Clojure]] by Michael Fogus (me) and Chris Houser - The /next/ book that dives a bit deeper than the other Clojure books on the market.
- [[https://www.amazon.com/Elements-Clojure-Zachary-Tellman/dp/0359360580/?tag=fogus-20][Elements of Clojure]] by Zach Tellman - Similar to The Joy of Clojure but focuses more on the philosophy of composing systems in Clojure.

A notable addition to this list is [[https://www.braveclojure.com/clojure-for-the-brave-and-true/][Clojure for the Brave and True]] by Daniel Higginbotham which is a book that's free to read online, but also has an option to purchase 
the book in print. In that vein is the tutorial [[https://aphyr.com/tags/Clojure-from-the-ground-up][Clojure from the Ground Up]] by Kyle Kingsbury that attempts to teach programming using Clojure. Either of these books could
be read before the books above to gain a sense for the language and what is has to offer.

* Notable Clojure Blogs

There are tons of blogs that focus on or touch on Clojure in a panoply of ways. A near comprehensive list is found at [[http://planet.clojure.in][Planet Clojure]], run by the inimitable Baishamapayan 
Ghose. Below you'll find the blogs that I simply cannot bear to miss along with a blurb about each.

- [[https://adambard.com/blog][Adam Bard makes websites]] used to write great Clojure-related articles but he seems to have stopped blogging. The archive is filled with pure gold however.
- [[https://stuartsierra.com][Digital Digressions]] by Stuart Sierra has great Clojure content filled with wisdom gained from years in the trenches.
- [[https://insideclojure.org/archive/][Inside Clojure]] by Alex Miller gives an insider's view on the development and maintenance of Clojure itself.
- [[https://lambdaisland.com/blog][Lambda Island Blog]] is filled with practical and or fun examples of Clojure / ClojureScript code.
- [[http://blog.fogus.me][Send More Paramedics]] is my personal blog that I occassionally populate with Clojure content, though it's not strictly a Clojure blog.
- [[http://gigasquidsoftware.com][Squid's Blog]] is run by Carin Meier and touches on a bunch of Clojure-related topics including AI, ML, stories, and NLP.

* Programming Environments

TODO

